public class TODO {
    public static void main(String[] args) {

    }
}


// Переделать сабстринги в сплиты - СДЕЛАНО

// Переделать findAndPrintEmployee (Employee, строка 591 и ниже) - СДЕЛАНО

// Заменить поиск на стримы в ChangeEmployee и DeleteEmployee!!! - НЕ СДЕЛАНО. В МЕТОДЕ НАДО ВЫБРАТЬ АЙДИШНИК И АКТИВИРОВАТЬ БУЛЕВУ ПЕРЕМЕННУЮ. КАК СДЕЛАТЬ ЭТО ЧЕРЕЗ СТРИМЫ - НЕ ЗНАЮ. ПРОБОВАЛ - НЕ ПОЛУЧАЕТСЯ.

// LocalDate - попробовать перевести даты - СДЕЛАНО

// Перепаять считывание под LocalDate!!! - НЕ СДЕЛАНО, ОСТАВИЛ СТАРЫЙ ВАРИАНТ

// Перепаять номера телефона полной строкой в 11 символов!!! В строке телефона оставляем только цифры!!! - СДЕЛАНО

// Убрать ненужные импорты! - СДЕЛАНО

// Пробить все классы по длине - СДЕЛАНО

// Убрать ненужные комментарии!!! - СДЕЛАНО
// Перебросить нужные комментарии вверх, в строку над методами!!! - СДЕЛАНО НЕ ВЕЗДЕ. ВЫСВЕЧИВАЕТСЯ СТРОКА С "USAGE", КОММЕНТАРИИ СВЕРХУ СМОТРЕТЬ НЕУДОБНО. ПРИМЕР - В КЛАССЕ Comparators